Repository: davidpovarsky/hanlin-ai
Catalog: AI_HLY/Downstream/MCP/Resources/MCPLocalizable.xcstrings
Source language: en
Languages: he, zh_hans

source: %d tools
he: %d כלים
zh_hans: %d 个工具

source: Active workers
he: Workers פעילים
zh_hans: 活动 Worker

source: Arguments
he: ארגומנטים
zh_hans: 参数

source: Add MCP Server
he: הוספת שרת MCP
zh_hans: 添加 MCP 服务器

source: Add variable
he: הוספת משתנה
zh_hans: 添加变量

source: Auto-start
he: הפעלה אוטומטית
zh_hans: 自动启动

source: Cancel
he: ביטול
zh_hans: 取消

source: Checking compatibility
he: בדיקת תאימות
zh_hans: 正在检查兼容性

source: Choose which installed MCP servers the assistant may use.
he: בחרו באילו שרתי MCP מותקנים העוזר רשאי להשתמש.
zh_hans: 选择助手可以使用的已安装 MCP 服务器。

source: Compatibility
he: תאימות
zh_hans: 兼容性

source: Completed
he: הושלם
zh_hans: 已完成

source: Dependencies
he: תלויות
zh_hans: 依赖项

source: Disable All for This Chat
he: השבתת הכול בשיחה זו
zh_hans: 为此对话全部禁用

source: Disabled
he: מושבת
zh_hans: 已禁用

source: Display name
he: שם תצוגה
zh_hans: 显示名称

source: Downloading
he: הורדה
zh_hans: 正在下载

source: Enable MCP Servers
he: הפעלת שרתי MCP
zh_hans: 启用 MCP 服务器

source: Enabled
he: מופעל
zh_hans: 已启用

source: Enabled for new chats
he: מופעל בשיחות חדשות
zh_hans: 为新对话启用

source: Enabled globally
he: מופעל באופן גלובלי
zh_hans: 全局启用

source: Entry point
he: נקודת כניסה
zh_hans: 入口点

source: Environment
he: משתני סביבה
zh_hans: 环境变量

source: Extracting
he: חילוץ
zh_hans: 正在解压

source: Failed
he: נכשל
zh_hans: 失败

source: Import .tgz file
he: ייבוא קובץ ‎.tgz
zh_hans: 导入 .tgz 文件

source: Install
he: התקנה
zh_hans: 安装

source: Install a trusted JavaScript MCP package to begin.
he: כדי להתחיל, התקינו חבילת MCP מהימנה ב־JavaScript.
zh_hans: 请先安装可信的 JavaScript MCP 包。

source: Installation cancelled
he: ההתקנה בוטלה
zh_hans: 安装已取消

source: Installation completed
he: ההתקנה הושלמה
zh_hans: 安装完成

source: Installed servers
he: שרתים מותקנים
zh_hans: 已安装的服务器

source: Installing dependencies
he: התקנת תלויות
zh_hans: 正在安装依赖项

source: MCP master switch
he: מתג MCP ראשי
zh_hans: MCP 总开关

source: MCP Servers
he: שרתי MCP
zh_hans: MCP 服务器

source: MCP servers for this chat
he: שרתי MCP לשיחה זו
zh_hans: 此对话的 MCP 服务器

source: MCP tool
he: כלי MCP
zh_hans: MCP 工具

source: MCP tool failed
he: כלי MCP נכשל
zh_hans: MCP 工具失败

source: No content returned
he: לא הוחזר תוכן
zh_hans: 未返回内容

source: No logs
he: אין לוגים
zh_hans: 暂无日志

source: No MCP servers installed
he: לא מותקנים שרתי MCP
zh_hans: 尚未安装 MCP 服务器

source: Node requirement
he: דרישת Node
zh_hans: Node 要求

source: Node runtime
he: סביבת Node
zh_hans: Node 运行时

source: Node version
he: גרסת Node
zh_hans: Node 版本

source: Not specified
he: לא צוין
zh_hans: 未指定

source: Open MCP settings
he: פתיחת הגדרות MCP
zh_hans: 打开 MCP 设置

source: Package
he: חבילה
zh_hans: 软件包

source: Package name or .tgz URL
he: שם חבילה או כתובת ‎.tgz
zh_hans: 包名或 .tgz URL

source: Package source
he: מקור החבילה
zh_hans: 软件包来源

source: Passed
he: עבר
zh_hans: 已通过

source: Pending
he: ממתין
zh_hans: 待处理

source: Preview
he: תצוגה מקדימה
zh_hans: 预览

source: Reading package metadata
he: קריאת נתוני החבילה
zh_hans: 正在读取软件包元数据

source: Refresh
he: רענון
zh_hans: 刷新

source: Refresh tools
he: רענון כלים
zh_hans: 刷新工具

source: Registering
he: רישום
zh_hans: 正在注册

source: Resolving
he: פתרון
zh_hans: 正在解析

source: Restart
he: הפעלה מחדש
zh_hans: 重新启动

source: Restart workers
he: הפעלה מחדש של Workers
zh_hans: 重启 Worker

source: Running
he: פועל
zh_hans: 运行中

source: Runtime
he: סביבת הרצה
zh_hans: 运行时

source: Runtime logs
he: לוגי סביבת ההרצה
zh_hans: 运行时日志

source: Runtime probe
he: בדיקת הרצה
zh_hans: 运行时探测

source: Save
he: שמירה
zh_hans: 保存

source: Secret value
he: ערך סודי
zh_hans: 密钥值

source: Select All
he: בחירת הכול
zh_hans: 全选

source: Server
he: שרת
zh_hans: 服务器

source: Servers
he: שרתים
zh_hans: 服务器

source: Start
he: הפעלה
zh_hans: 启动

source: Starting
he: מתחיל
zh_hans: 正在启动

source: Stop
he: עצירה
zh_hans: 停止

source: Stopped
he: נעצר
zh_hans: 已停止

source: Store in Keychain
he: שמירה ב־Keychain
zh_hans: 存储到钥匙串

source: The selected model does not support tool calling.
he: המודל שנבחר אינו תומך בקריאה לכלים.
zh_hans: 所选模型不支持工具调用。

source: This package contains executable JavaScript and will run inside Hanlin's application sandbox. Install only packages you trust.
he: חבילה זו מכילה JavaScript בר־הרצה ותפעל בתוך ארגז החול של Hanlin. התקינו רק חבילות מהימנות.
zh_hans: 此软件包包含可执行 JavaScript，并将在 Hanlin 的应用沙盒中运行。请仅安装您信任的软件包。

source: No tools
he: אין כלים
zh_hans: 没有工具

source: Package management
he: ניהול חבילה
zh_hans: 软件包管理

source: Reinstall
he: התקנה מחדש
zh_hans: 重新安装

source: Tools
he: כלים
zh_hans: 工具

source: Uninstall
he: הסרת התקנה
zh_hans: 卸载

source: Update
he: עדכון
zh_hans: 更新

source: Value
he: ערך
zh_hans: 值

source: Variable name
he: שם המשתנה
zh_hans: 变量名

source: Verifying
he: אימות
zh_hans: 正在验证

source: Version
he: גרסה
zh_hans: 版本

source: View logs
he: הצגת לוגים
zh_hans: 查看日志

source: View tools
he: הצגת כלים
zh_hans: 查看工具

source: View runtime logs
he: הצגת לוגי סביבת ההרצה
zh_hans: 查看运行时日志
